# ERD

![png](sakila-db-model.png)

# SQL Queries

In [8]:
import pymysql
import pandas as pd
from sqlalchemy import create_engine

pymysql.install_as_MySQLdb()

In [12]:
connection = "mysql+pymysql://root:Hannah#0103@localhost/sakila"

In [13]:
engine = create_engine(connection)

In [14]:
connection

'mysql+pymysql://root:Hannah#0103@localhost/sakila'

## All Customers inside city_id 312

In [22]:

q1 = """SELECT c.first_name, c.last_name, c.email, cit.city
       FROM customer as c
       JOIN city as cit ON c.customer_id = cit.country_id
       WHERE cit.city_id = 312;"""

pd.read_sql(q, engine)

  first_name last_name                            email    city
0    CRYSTAL      FORD  CRYSTAL.FORD@sakilacustomer.org  London

## All comdey films

In [23]:
q2 = """SELECT f.title, f.description, f.release_year, f.rating, f.special_features
        FROM film AS f
        JOIN category as c ON f.film_id = c.category_id
        WHERE c.name = "Comedy";"""

pd.read_sql(q2, engine)

,title,description,release_year,rating,special_features
0,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,G,Deleted Scenes

## All films with Johnny Lollobrigida

In [24]:
q3 = """SELECT f.title, f.release_year, a.last_name
        FROM film AS f
        JOIN actor AS a ON f.film_id = a.actor_id
        WHERE a.first_name = 'Johnny' AND a.last_name = 'Lollobrigida';"""

pd.read_sql(q3, engine)

         title  release_year     last_name
0  AFRICAN EGG          2006  LOLLOBRIGIDA

## Actors in movie "Bingo Talented"

In [26]:
q4 = """SELECT a.first_name, a.last_name
        FROM actor AS a
        JOIN film AS f ON f.film_id = a.actor_id
        WHERE f.title = 'Bingo Talented';"""

pd.read_sql(q4, engine)

  first_name last_name
0       GARY      PENN

## Customers with payments greater than 2 times the average payment

In [27]:
q5 = """SELECT customer_id, amount
        FROM payment
        WHERE amount >
            (SELECT 2*AVG(amount)
             FROM payment)
        ORDER BY amount ASC"""

pd.read_sql(q5, engine)

     customer_id  amount
0             75    8.97
1              3    8.99
2              3    8.99
3              3    8.99
4              4    8.99
..           ...     ...
852          237   11.99
853          305   11.99
854          362   11.99
855          591   11.99
856          592   11.99

[857 rows x 2 columns]

## First 5 customers with the highest amount of payments

In [28]:
q6 = """SELECT c.first_name, c.last_name,
            (SELECT COUNT(*)
             FROM payment
             WHERE c.customer_id = payment.customer_id) AS num_payments
        FROM customer AS c
        ORDER BY num_payments DESC
        LIMIT 5;
"""

pd.read_sql(q6, engine)

  first_name last_name  num_payments
0    ELEANOR      HUNT            46
1       KARL      SEAL            45
2     MARCIA      DEAN            42
3      CLARA      SHAW            42
4      TAMMY   SANDERS            41